namespace :db do
  desc 'It moves wistia videos to digitals'
  task :coupons => [ :environment ] do
    coupons = {
      1 => 'на страву у виконанні молодої',
      2 => "на пиво за рахунок молодого",
      3 => "на гарячий душ в гостях молодих",
      4 => "на допомогу у прибиранні кімнати молодими",
      5 => "на розробку сайту за півціни",
      6 => "на ведучого за півціни",
      7 => "на таксі за рахунок молодих",
      8 => "на пісню у виконанні молодого",
      9 => "на допомогу серед ночі",
      10 => "на смачну мівіну у виконанні молодих",
      11 => "на тортик від молодих",
      12 => "на смачну каву від молодої",
      13 => "на ночівлю в молодих",
      14 => "на страву у виконанні молодого",
      15 => "на день навпаки молодими",
      16 => "на шашлик з молодими",
      17 => "на макіяж від молодого",
      18 => "на похід в кіно з молодими",
      19 => "на масаж від моголого",
      20 => "на пляшку домашнього вина від молодих",
      21 => "на повторення танцю молодими",
      22 => "на чай з домашнім печивом від молодої",
      23 => "на те, щоб молодий прокатав з вєтєрком на машині, коли вона в нього з'явиться",
      24 => "на прийти в гості без попередження вночі",
      25 => "на проведення незабутніх вихідних у славетному місті Корець",
      26 => "на чистку картоплі молодим",
      27 => "на перестановку віндовса молодим",
      28 => "на негайне прибуття до себе в гості молодих",
      29 => "на перегляд футболу з пивом з молодим",
      30 => "на гру в теніс з молодими",
      31 => "на пришиття гудзика молодою",
      32 => "на догляд за дитиною на 1 день молодою",
      33 => "на похід на картинг з молодим",
    }
    coupons.each_with_index do |coupon, index|
      Coupon.create(number: index+1, name: coupon[1], image: "/images/coupons/#{index+1}.jpg")
    end
  end
end
